ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u5f9xx.h
/*******************  Bit definition for DSI_WPCR0 register  ***************/
#define DSI_WPCR0_SWCL_Pos            (6U)
#define DSI_WPCR0_SWCL_Msk            (0x1UL << DSI_WPCR0_SWCL_Pos)            /*!< 0x00000040 */
#define DSI_WPCR0_SWCL                DSI_WPCR0_SWCL_Msk                       /*!< Swap pins on clock lane */
#define DSI_WPCR0_SWDL0_Pos           (7U)
#define DSI_WPCR0_SWDL0_Msk           (0x1UL << DSI_WPCR0_SWDL0_Pos)           /*!< 0x00000080 */
#define DSI_WPCR0_SWDL0               DSI_WPCR0_SWDL0_Msk                      /*!< Swap pins on data lane 1 */
#define DSI_WPCR0_SWDL1_Pos           (8U)
#define DSI_WPCR0_SWDL1_Msk           (0x1UL << DSI_WPCR0_SWDL1_Pos)           /*!< 0x00000100 */
#define DSI_WPCR0_SWDL1               DSI_WPCR0_SWDL1_Msk                      /*!< Swap pins on data lane 2 */
#define DSI_WPCR0_FTXSMCL_Pos         (12U)
#define DSI_WPCR0_FTXSMCL_Msk         (0x1UL << DSI_WPCR0_FTXSMCL_Pos)         /*!< 0x00001000 */
#define DSI_WPCR0_FTXSMCL             DSI_WPCR0_FTXSMCL_Msk                    /*!< Force clock lane in TX stop mode */
#define DSI_WPCR0_FTXSMDL_Pos         (13U)
#define DSI_WPCR0_FTXSMDL_Msk         (0x1UL << DSI_WPCR0_FTXSMDL_Pos)         /*!< 0x00002000 */
#define DSI_WPCR0_FTXSMDL             DSI_WPCR0_FTXSMDL_Msk                    /*!< Force data lanes in TX stop mode */

/*******************  Bit definition for DSI_WRPCR register  ***************/
#define DSI_WRPCR_PLLEN_Pos           (0U)
#define DSI_WRPCR_PLLEN_Msk           (0x1UL << DSI_WRPCR_PLLEN_Pos)           /*!< 0x00000001 */
#define DSI_WRPCR_PLLEN               DSI_WRPCR_PLLEN_Msk                      /*!< PLL Enable */
#define DSI_WRPCR_PLL_NDIV_Pos        (2U)
#define DSI_WRPCR_PLL_NDIV_Msk        (0x1FFUL << DSI_WRPCR_PLL_NDIV_Pos)      /*!< 0x000007FC */
#define DSI_WRPCR_PLL_NDIV            DSI_WRPCR_PLL_NDIV_Msk                   /*!< PLL Loop Division Factor */
#define DSI_WRPCR_PLL_NDIV0_Pos       (2U)
#define DSI_WRPCR_PLL_NDIV0_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV0_Pos)       /*!< 0x00000004 */
#define DSI_WRPCR_PLL_NDIV0           DSI_WRPCR_PLL_NDIV0_Msk
#define DSI_WRPCR_PLL_NDIV1_Pos       (3U)
#define DSI_WRPCR_PLL_NDIV1_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV1_Pos)       /*!< 0x00000008 */
#define DSI_WRPCR_PLL_NDIV1           DSI_WRPCR_PLL_NDIV1_Msk
#define DSI_WRPCR_PLL_NDIV2_Pos       (4U)
#define DSI_WRPCR_PLL_NDIV2_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV2_Pos)       /*!< 0x00000010 */
#define DSI_WRPCR_PLL_NDIV2           DSI_WRPCR_PLL_NDIV2_Msk
#define DSI_WRPCR_PLL_NDIV3_Pos       (5U)
#define DSI_WRPCR_PLL_NDIV3_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV3_Pos)       /*!< 0x00000020 */
#define DSI_WRPCR_PLL_NDIV3           DSI_WRPCR_PLL_NDIV3_Msk
#define DSI_WRPCR_PLL_NDIV4_Pos       (6U)
#define DSI_WRPCR_PLL_NDIV4_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV4_Pos)       /*!< 0x00000040 */
#define DSI_WRPCR_PLL_NDIV4           DSI_WRPCR_PLL_NDIV4_Msk
#define DSI_WRPCR_PLL_NDIV5_Pos       (7U)
#define DSI_WRPCR_PLL_NDIV5_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV5_Pos)       /*!< 0x00000080 */
#define DSI_WRPCR_PLL_NDIV5           DSI_WRPCR_PLL_NDIV5_Msk
#define DSI_WRPCR_PLL_NDIV6_Pos       (8U)
#define DSI_WRPCR_PLL_NDIV6_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV6_Pos)       /*!< 0x00000100 */
#define DSI_WRPCR_PLL_NDIV6           DSI_WRPCR_PLL_NDIV6_Msk
#define DSI_WRPCR_PLL_NDIV7_Pos       (9U)
#define DSI_WRPCR_PLL_NDIV7_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV7_Pos)       /*!< 0x00000200 */
#define DSI_WRPCR_PLL_NDIV7           DSI_WRPCR_PLL_NDIV7_Msk
#define DSI_WRPCR_PLL_NDIV8_Pos       (10U)
#define DSI_WRPCR_PLL_NDIV8_Msk       (0x1UL << DSI_WRPCR_PLL_NDIV8_Pos)       /*!< 0x00000400 */
#define DSI_WRPCR_PLL_NDIV8           DSI_WRPCR_PLL_NDIV8_Msk

#define DSI_WRPCR_PLL_IDF_Pos         (11U)
#define DSI_WRPCR_PLL_IDF_Msk         (0x1FFUL << DSI_WRPCR_PLL_IDF_Pos)       /*!< 0x000FF800 */
#define DSI_WRPCR_PLL_IDF             DSI_WRPCR_PLL_IDF_Msk                    /*!< PLL Input Division Factor */
#define DSI_WRPCR_PLL_IDF0_Pos        (11U)
#define DSI_WRPCR_PLL_IDF0_Msk        (0x1UL << DSI_WRPCR_PLL_IDF0_Pos)        /*!< 0x00000800 */
#define DSI_WRPCR_PLL_IDF0            DSI_WRPCR_PLL_IDF0_Msk
#define DSI_WRPCR_PLL_IDF1_Pos        (12U)
#define DSI_WRPCR_PLL_IDF1_Msk        (0x1UL << DSI_WRPCR_PLL_IDF1_Pos)        /*!< 0x00001000 */
#define DSI_WRPCR_PLL_IDF1            DSI_WRPCR_PLL_IDF1_Msk
#define DSI_WRPCR_PLL_IDF2_Pos        (13U)
#define DSI_WRPCR_PLL_IDF2_Msk        (0x1UL << DSI_WRPCR_PLL_IDF2_Pos)        /*!< 0x00002000 */
#define DSI_WRPCR_PLL_IDF2            DSI_WRPCR_PLL_IDF2_Msk
#define DSI_WRPCR_PLL_IDF3_Pos        (14U)
#define DSI_WRPCR_PLL_IDF3_Msk        (0x1UL << DSI_WRPCR_PLL_IDF3_Pos)        /*!< 0x00004000 */
#define DSI_WRPCR_PLL_IDF3            DSI_WRPCR_PLL_IDF3_Msk
#define DSI_WRPCR_PLL_IDF4_Pos        (15U)
#define DSI_WRPCR_PLL_IDF4_Msk        (0x1UL << DSI_WRPCR_PLL_IDF4_Pos)        /*!< 0x00008000 */
#define DSI_WRPCR_PLL_IDF4            DSI_WRPCR_PLL_IDF4_Msk
#define DSI_WRPCR_PLL_IDF5_Pos        (16U)
#define DSI_WRPCR_PLL_IDF5_Msk        (0x1UL << DSI_WRPCR_PLL_IDF5_Pos)        /*!< 0x00010000 */
#define DSI_WRPCR_PLL_IDF5            DSI_WRPCR_PLL_IDF5_Msk
#define DSI_WRPCR_PLL_IDF6_Pos        (17U)
#define DSI_WRPCR_PLL_IDF6_Msk        (0x1UL << DSI_WRPCR_PLL_IDF6_Pos)        /*!< 0x00020000 */
#define DSI_WRPCR_PLL_IDF6            DSI_WRPCR_PLL_IDF6_Msk
#define DSI_WRPCR_PLL_IDF7_Pos        (18U)
#define DSI_WRPCR_PLL_IDF7_Msk        (0x1UL << DSI_WRPCR_PLL_IDF7_Pos)        /*!< 0x00040000 */
#define DSI_WRPCR_PLL_IDF7            DSI_WRPCR_PLL_IDF7_Msk
#define DSI_WRPCR_PLL_IDF8_Pos        (19U)
#define DSI_WRPCR_PLL_IDF8_Msk        (0x1UL << DSI_WRPCR_PLL_IDF8_Pos)        /*!< 0x00080000 */
#define DSI_WRPCR_PLL_IDF8            DSI_WRPCR_PLL_IDF8_Msk

#define DSI_WRPCR_PLL_ODF_Pos         (20U)
#define DSI_WRPCR_PLL_ODF_Msk         (0x1FFUL << DSI_WRPCR_PLL_ODF_Pos)       /*!< 0x1FF00000 */
#define DSI_WRPCR_PLL_ODF             DSI_WRPCR_PLL_ODF_Msk                    /*!< PLL Output Division Factor */
#define DSI_WRPCR_PLL_ODF0_Pos        (20U)
#define DSI_WRPCR_PLL_ODF0_Msk        (0x1UL << DSI_WRPCR_PLL_ODF0_Pos)        /*!< 0x00100000 */
#define DSI_WRPCR_PLL_ODF0            DSI_WRPCR_PLL_ODF0_Msk
#define DSI_WRPCR_PLL_ODF1_Pos        (21U)
#define DSI_WRPCR_PLL_ODF1_Msk        (0x1UL << DSI_WRPCR_PLL_ODF1_Pos)        /*!< 0x00200000 */
#define DSI_WRPCR_PLL_ODF1            DSI_WRPCR_PLL_ODF1_Msk
#define DSI_WRPCR_PLL_ODF2_Pos        (22U)
#define DSI_WRPCR_PLL_ODF2_Msk        (0x1UL << DSI_WRPCR_PLL_ODF2_Pos)        /*!< 0x00400000 */
#define DSI_WRPCR_PLL_ODF2            DSI_WRPCR_PLL_ODF2_Msk
#define DSI_WRPCR_PLL_ODF3_Pos        (23U)
#define DSI_WRPCR_PLL_ODF3_Msk        (0x1UL << DSI_WRPCR_PLL_ODF3_Pos)        /*!< 0x00800000 */
#define DSI_WRPCR_PLL_ODF3            DSI_WRPCR_PLL_ODF3_Msk
#define DSI_WRPCR_PLL_ODF4_Pos        (24U)
#define DSI_WRPCR_PLL_ODF4_Msk        (0x1UL << DSI_WRPCR_PLL_ODF4_Pos)        /*!< 0x01000000 */
#define DSI_WRPCR_PLL_ODF4            DSI_WRPCR_PLL_ODF4_Msk
#define DSI_WRPCR_PLL_ODF5_Pos        (25U)
#define DSI_WRPCR_PLL_ODF5_Msk        (0x1UL << DSI_WRPCR_PLL_ODF5_Pos)        /*!< 0x02000000 */
#define DSI_WRPCR_PLL_ODF5            DSI_WRPCR_PLL_ODF5_Msk
#define DSI_WRPCR_PLL_ODF6_Pos        (26U)
#define DSI_WRPCR_PLL_ODF6_Msk        (0x1UL << DSI_WRPCR_PLL_ODF6_Pos)        /*!< 0x04000000 */
#define DSI_WRPCR_PLL_ODF6            DSI_WRPCR_PLL_ODF6_Msk
#define DSI_WRPCR_PLL_ODF7_Pos        (27U)
#define DSI_WRPCR_PLL_ODF7_Msk        (0x1UL << DSI_WRPCR_PLL_ODF7_Pos)        /*!< 0x08000000 */
#define DSI_WRPCR_PLL_ODF7            DSI_WRPCR_PLL_ODF7_Msk
#define DSI_WRPCR_PLL_ODF8_Pos        (28U)
#define DSI_WRPCR_PLL_ODF8_Msk        (0x1UL << DSI_WRPCR_PLL_ODF8_Pos)        /*!< 0x10000000 */
#define DSI_WRPCR_PLL_ODF8            DSI_WRPCR_PLL_ODF8_Msk
#define DSI_WRPCR_BC_Pos              (29U)
#define DSI_WRPCR_BC_Msk              (0x1UL << DSI_WRPCR_BC_Pos)              /*!< 0x10000000 */
#define DSI_WRPCR_BC                  DSI_WRPCR_BC_Msk
/*******************  Bit definition for DSI_WPTR register  ***************/
#define DSI_WPTR_CP_Pos              (8U)
#define DSI_WPTR_CP_Msk              (0xFUL << DSI_WPTR_CP_Pos)                /*!< 0x00000F00 */
#define DSI_WPTR_CP                  DSI_WPTR_CP_Msk                           /*!< Wrapper PLL tuning charge pump */
#define DSI_WPTR_CP0_Pos             (8U)
#define DSI_WPTR_CP0_Msk             (0x1UL << DSI_WPTR_CP0_Pos)               /*!< 0x00000100 */
#define DSI_WPTR_CP0                  DSI_WPTR_CP0_Msk
#define DSI_WPTR_CP1_Pos             (9U)
#define DSI_WPTR_CP1_Msk             (0x1UL << DSI_WPTR_CP1_Pos)               /*!< 0x00000200 */
#define DSI_WPTR_CP1                  DSI_WPTR_CP1_Msk
#define DSI_WPTR_CP2_Pos             (10U)
#define DSI_WPTR_CP2_Msk             (0x1UL << DSI_WPTR_CP2_Pos)               /*!< 0x00000400 */
#define DSI_WPTR_CP2                  DSI_WPTR_CP2_Msk
#define DSI_WPTR_CP3_Pos             (11U)
#define DSI_WPTR_CP3_Msk             (0x1UL << DSI_WPTR_CP3_Pos)               /*!< 0x00000800 */
#define DSI_WPTR_CP3                  DSI_WPTR_CP3_Msk
#define DSI_WPTR_LPF_Pos             (12U)
#define DSI_WPTR_LPF_Msk             (0xFUL << DSI_WPTR_LPF_Pos)               /*!< 0x0000F000 */
#define DSI_WPTR_LPF                  DSI_WPTR_LPF_Msk                         /*!< Wrapper PLL tuning loop filter */
#define DSI_WPTR_LPF0_Pos            (12U)
#define DSI_WPTR_LPF0_Msk            (0x1UL << DSI_WPTR_LPF0_Pos)              /*!< 0x00001000 */
#define DSI_WPTR_LPF0                DSI_WPTR_LPF0_Msk
#define DSI_WPTR_LPF1_Pos            (13U)
#define DSI_WPTR_LPF1_Msk            (0x1UL << DSI_WPTR_LPF1_Pos)              /*!< 0x00002000 */
#define DSI_WPTR_LPF1                 DSI_WPTR_LPF1_Msk
#define DSI_WPTR_LPF2_Pos            (14U)
#define DSI_WPTR_LPF2_Msk            (0x1UL << DSI_WPTR_LPF2_Pos)              /*!< 0x00004000 */
#define DSI_WPTR_LPF2                 DSI_WPTR_LPF2_Msk
#define DSI_WPTR_LPF3_Pos            (15U)
#define DSI_WPTR_LPF3_Msk            (0x1UL << DSI_WPTR_LPF3_Pos)              /*!< 0x00008000 */
#define DSI_WPTR_LPF3                 DSI_WPTR_LPF3_Msk

